# DataFrame and Series

In [63]:
import pandas as pd

## Pandas DataFrame

In [64]:
AAPL = pd.read_csv("data/aapldata.csv", index_col=0) #讀取csv檔案

In [65]:
AAPL.head()

             open    high       low   close    volume
date
2018/3/20  175.24  176.80  174.9400  175.24  19620520
2018/3/19  177.32  177.47  173.6600  175.30  32931110
2018/3/16  178.65  179.12  177.6200  178.02  38313330
2018/3/15  178.50  180.24  178.0701  178.65  22676520
2018/3/14  180.32  180.52  177.8100  178.44  29334630

In [66]:
type(AAPL)

pandas.core.frame.DataFrame

In [67]:
AAPL.shape

(377, 5)

## index and columns

In [68]:
AAPL.columns

Index(['open', 'high', 'low', 'close', 'volume'], dtype='object')

In [69]:
type(AAPL.columns)

pandas.core.indexes.base.Index

In [70]:
AAPL.index

Index(['2018/3/20', '2018/3/19', '2018/3/16', '2018/3/15', '2018/3/14',
       '2018/3/13', '2018/3/12', '2018/3/9', '2018/3/8', '2018/3/7',
       ...
       '2016/10/3', '2016/9/30', '2016/9/29', '2016/9/28', '2016/9/27',
       '2016/9/26', '2016/9/23', '2016/9/22', '2016/9/21', '2016/9/20'],
      dtype='object', name='date', length=377)

In [71]:
type(AAPL.index)

pandas.core.indexes.base.Index

## slicing

In [72]:
AAPL.iloc[:5, :]

             open    high       low   close    volume
date
2018/3/20  175.24  176.80  174.9400  175.24  19620520
2018/3/19  177.32  177.47  173.6600  175.30  32931110
2018/3/16  178.65  179.12  177.6200  178.02  38313330
2018/3/15  178.50  180.24  178.0701  178.65  22676520
2018/3/14  180.32  180.52  177.8100  178.44  29334630

In [73]:
AAPL.iloc[-5:, :]

             open     high      low   close    volume
date
2016/9/26  111.64  113.390  111.550  112.88  29800240
2016/9/23  114.42  114.790  111.550  112.71  52411070
2016/9/22  114.35  114.940  114.000  114.62  31048170
2016/9/21  113.85  113.989  112.441  113.55  35951900
2016/9/20  113.05  114.120  112.510  113.57  34494150

## head()

In [74]:
AAPL.head()

             open    high       low   close    volume
date
2018/3/20  175.24  176.80  174.9400  175.24  19620520
2018/3/19  177.32  177.47  173.6600  175.30  32931110
2018/3/16  178.65  179.12  177.6200  178.02  38313330
2018/3/15  178.50  180.24  178.0701  178.65  22676520
2018/3/14  180.32  180.52  177.8100  178.44  29334630

In [75]:
AAPL.head(2)

             open    high     low   close    volume
date
2018/3/20  175.24  176.80  174.94  175.24  19620520
2018/3/19  177.32  177.47  173.66  175.30  32931110

## tail()

In [76]:
AAPL.tail()

             open     high      low   close    volume
date
2016/9/26  111.64  113.390  111.550  112.88  29800240
2016/9/23  114.42  114.790  111.550  112.71  52411070
2016/9/22  114.35  114.940  114.000  114.62  31048170
2016/9/21  113.85  113.989  112.441  113.55  35951900
2016/9/20  113.05  114.120  112.510  113.57  34494150

In [77]:
AAPL.tail(3)

             open     high      low   close    volume
date
2016/9/22  114.35  114.940  114.000  114.62  31048170
2016/9/21  113.85  113.989  112.441  113.55  35951900
2016/9/20  113.05  114.120  112.510  113.57  34494150

## info()

In [78]:
AAPL.info()

<class 'pandas.core.frame.DataFrame'>
Index: 377 entries, 2018/3/20 to 2016/9/20
Data columns (total 5 columns):
open      377 non-null float64
high      377 non-null float64
low       377 non-null float64
close     377 non-null float64
volume    377 non-null int64
dtypes: float64(4), int64(1)
memory usage: 17.7+ KB

## brocasting

In [79]:
import numpy as np
AAPL.iloc[::3, -1]=np.nan
AAPL.head(6)

             open    high       low   close      volume
date
2018/3/20  175.24  176.80  174.9400  175.24         NaN
2018/3/19  177.32  177.47  173.6600  175.30  32931110.0
2018/3/16  178.65  179.12  177.6200  178.02  38313330.0
2018/3/15  178.50  180.24  178.0701  178.65         NaN
2018/3/14  180.32  180.52  177.8100  178.44  29334630.0
2018/3/13  182.59  183.50  179.2400  179.97  31464170.0

In [80]:
AAPL.info()

<class 'pandas.core.frame.DataFrame'>
Index: 377 entries, 2018/3/20 to 2016/9/20
Data columns (total 5 columns):
open      377 non-null float64
high      377 non-null float64
low       377 non-null float64
close     377 non-null float64
volume    251 non-null float64
dtypes: float64(5)
memory usage: 17.7+ KB

In [81]:
low = AAPL["low"]

In [82]:
type(low)

pandas.core.series.Series

In [83]:
low.head()

date
2018/3/20    174.9400
2018/3/19    173.6600
2018/3/16    177.6200
2018/3/15    178.0701
2018/3/14    177.8100
Name: low, dtype: float64

## series

In [84]:
lows = low.values

In [85]:
type(lows)

numpy.ndarray